In [16]:
import numpy as np
import pandas as pd

In [17]:
marks=pd.Series([30,35,40], index=['python','dsa','dbms'])
marks

python    30
dsa       35
dbms      40
dtype: int64

In [18]:
d={"name":'vrund',"gmail":'vrund@gmail.com',"adress":'vadodara'}

In [19]:
student=pd.Series(d)

In [20]:
student

name                vrund
gmail     vrund@gmail.com
adress           vadodara
dtype: object

In [21]:
student.keys()

Index(['name', 'gmail', 'adress'], dtype='object')

In [22]:
student.values

array(['vrund', 'vrund@gmail.com', 'vadodara'], dtype=object)

In [44]:
marks=np.random.randint(0,100,(3,3))
marks

array([[61, 88, 59],
       [78, 92,  9],
       [ 6, 15, 71]])

In [45]:
Result=pd.DataFrame(marks,index=['vrund','harshit','smit'],columns=['python','dsa','dbms'])
Result

         python  dsa  dbms
vrund        61   88    59
harshit      78   92     9
smit          6   15    71

In [25]:
Result['python']

vrund      98
harshit    78
smit       21
Name: python, dtype: int32

In [26]:
Result[['python','dbms']]

         python  dbms
vrund        98    76
harshit      78    22
smit         21    72

In [27]:
Result.loc['vrund']

python    98
dsa       22
dbms      76
Name: vrund, dtype: int32

In [28]:
Result.loc[['vrund','harshit']]

         python  dsa  dbms
vrund        98   22    76
harshit      78    7    22

In [29]:
Result['total']=Result['python']+Result['dsa']+Result['dbms']
Result

         python  dsa  dbms  total
vrund        98   22    76    196
harshit      78    7    22    107
smit         21    4    72     97

In [30]:
Result['percentage']=Result['total']/3

In [31]:
Result

         python  dsa  dbms  total  percentage
vrund        98   22    76    196   65.333333
harshit      78    7    22    107   35.666667
smit         21    4    72     97   32.333333

In [32]:
Result.drop('python',axis=1,inplace=True)

In [33]:
Result

         dsa  dbms  total  percentage
vrund     22    76    196   65.333333
harshit    7    22    107   35.666667
smit       4    72     97   32.333333

In [34]:
Result.loc['vrund']

dsa            22.000000
dbms           76.000000
total         196.000000
percentage     65.333333
Name: vrund, dtype: float64

In [35]:
Result.drop('vrund',axis=0)

         dsa  dbms  total  percentage
harshit    7    22    107   35.666667
smit       4    72     97   32.333333

In [36]:
Result.describe()

             dsa       dbms       total  percentage
count   3.000000   3.000000    3.000000    3.000000
mean   11.000000  56.666667  133.333333   44.444444
std     9.643651  30.088758   54.500765   18.166922
min     4.000000  22.000000   97.000000   32.333333
25%     5.500000  47.000000  102.000000   34.000000
50%     7.000000  72.000000  107.000000   35.666667
75%    14.500000  74.000000  151.500000   50.500000
max    22.000000  76.000000  196.000000   65.333333

In [37]:
Result.head(2)

         dsa  dbms  total  percentage
vrund     22    76    196   65.333333
harshit    7    22    107   35.666667

In [38]:
Result.tail(2)

         dsa  dbms  total  percentage
harshit    7    22    107   35.666667
smit       4    72     97   32.333333

In [39]:
Result.loc[['vrund','harshit'],['dsa','dbms']]

         dsa  dbms
vrund     22    76
harshit    7    22

In [40]:
Result

         dsa  dbms  total  percentage
vrund     22    76    196   65.333333
harshit    7    22    107   35.666667
smit       4    72     97   32.333333

In [50]:
Result.loc['het']=[52,25,10.0]
Result

         python   dsa  dbms
vrund      61.0  88.0  59.0
harshit    78.0  92.0   9.0
smit       41.0  15.0  71.0
het        52.0  25.0  10.0

In [49]:
np.random.seed(1)
Result=pd.DataFrame(np.random.randint(1,100(4,3))),index=['vrund','harshit','smit','het']

SyntaxError: invalid syntax. Maybe you meant '==' or ':=' instead of '='? (589085609.py, line 2)

In [40]:
import numpy as np
import pandas as pd

In [48]:
Result[Result['python']<40]

Empty DataFrame
Columns: [python, dsa, dbms]
Index: []

In [47]:
Result.loc[Result['python']<40,'python']=41
Result

         python  dsa  dbms
vrund        61   88    59
harshit      78   92     9
smit         41   15    71

In [46]:
Result.add(20)

         dsa  dbms  total  percentage
vrund     42    96    216   85.333333
harshit   27    42    127   55.666667
smit      24    92    117   52.333333

In [47]:
Result

         dsa  dbms  total  percentage
vrund     22    76    196   65.333333
harshit    7    22    107   35.666667
smit       4    72     97   32.333333

In [48]:
Result>100

           dsa   dbms  total  percentage
vrund    False  False   True       False
harshit  False  False   True       False
smit     False  False  False       False

In [46]:
Result[(Result['python']>60)  & (Result['dsa']>45)]

         python  dsa  dbms
vrund        61   88    59
harshit      78   92     9

In [42]:
Result

         dsa  dbms  total  percentage
vrund     47    30     81        27.0
harshit   54    98    183        61.0
smit      48    12     78        26.0

In [51]:
Result[Result.index.str.startswith('v')]

       dsa  dbms  total  percentage
vrund   22    76    196   65.333333

In [52]:
Result[Result.index.str.endswith('t')]

         dsa  dbms  total  percentage
harshit    7    22    107   35.666667
smit       4    72     97   32.333333

In [51]:
Result

         python   dsa  dbms
vrund      61.0  88.0  59.0
harshit    78.0  92.0   9.0
smit       41.0  15.0  71.0
het        52.0  25.0  10.0

Result['total']=Result['python']+Result['dsa']+Result['dbms']
Result

In [55]:
Result['percentage']=Result['total']/3

In [56]:
Result

         python   dsa  dbms  total  percentage
vrund      61.0  88.0  59.0  208.0   69.333333
harshit    78.0  92.0   9.0  179.0   59.666667
smit       41.0  15.0  71.0  127.0   42.333333
het        52.0  25.0  10.0   87.0   29.000000

In [58]:
Result['result']=np.where(Result['percentage']<45,"pass","fail")
Result

         python   dsa  dbms  total  percentage result
vrund      61.0  88.0  59.0  208.0   69.333333   fail
harshit    78.0  92.0   9.0  179.0   59.666667   fail
smit       41.0  15.0  71.0  127.0   42.333333   pass
het        52.0  25.0  10.0   87.0   29.000000   pass